Tekla.Structures.ModelInternal.dotGuideline_t
The structure for passing guideline data between OpenAPI and core.

Tekla.Structures.ModelInternal.dotGuideline_t.Id
The database id.

Tekla.Structures.ModelInternal.dotGuideline_t.FirstPoint
The index of the first point in the rebarset's overall points list.

Tekla.Structures.ModelInternal.dotGuideline_t.NumberOfPoints
The number of contour points.

Tekla.Structures.ModelInternal.dotGuideline_t.Spacing
The spacing.